package org.example.staticdata.belorussian;

import org.example.staticdata.AbstractFIO;

import java.util.List;

public class BelorussianFemaleFIO extends AbstractFIO {
    private static final List<String> NATIONAL_NAMES = List.of(
            "Аглая", "Агнешка", "Агния", "Алевтина", "Александра", "Алена", "Алина", "Алиса", "Алла", "Анастасия", "Ангелина", "Анжела", "Анна", "Антонина", "Богдана", "Валентина", "Валерия", "Варвара", "Василиса", "Вера", "Вероника", "Виктория", "Виолетта", "Галина", "Дарья", "Диана", "Ева", "Евгения", "Екатерина", "Елена", "Елизавета", "Жанна", "Зинаида", "Зоя", "Инга", "Инесса", "Инна", "Ирина", "Калерия", "Каролина", "Кристина", "Ксения", "Лариса", "Леся", "Лидия", "Лилия", "Любовь", "Людмила", "Маргарита", "Марина", "Мария", "Марта", "Мирослава", "Надежда", "Наталья", "Нина", "Нонна", "Оксана", "Олеся", "Ольга", "Полина", "Раиса", "Регина", "Светлана", "Снежана", "София", "Станислава", "Стефания", "Тамара", "Татьяна", "Ульяна", "Фаина", "Яна", "Янина", "Ярина", "Ярослава"
    );

    private static final List<String> NATIONAL_SURNAMES = List.of(
            "Абрамович", "Адамович", "Акулович", "Александрович", "Андреевич", "Анисимович", "Антонович", "Артемович", "Бабович", "Багунович", "Баранович", "Барташевич", "Беланович", "Белицкая", "Белоусова", "Бельская", "Беркович", "Богданович", "Борисевич", "Борович", "Борткевич", "Босович", "Брилевич", "Будкевич", "Бурнович", "Бутаревич", "Василевич", "Винницкая", "Вишневская", "Володько", "Воронович", "Гаврилович", "Гайдукевич", "Галанович", "Герасимович", "Голубович", "Гончаревич", "Горбацевич", "Гордеевич", "Григорович", "Гришкевич", "Гуринович", "Давидович", "Дайнека", "Данкевич", "Демидович", "Демьянович", "Денисевич", "Доморацкая", "Дорошевич", "Досталевская", "Дроздович", "Дубовик", "Ермолович", "Жданович", "Жилевич", "Жукевич", "Забелло", "Заборович", "Зайцевич", "Змитрович", "Ивашкевич", "Игнатович", "Ильинична", "Казакевич", "Калиновская", "Карпович", "Киселевич", "Климович", "Ковалевич", "Козлович", "Коноплич", "Корбут", "Корнеевич", "Костюкевич", "Котович", "Кравцевич", "Купревич", "Курилович", "Лавринович", "Лапицкая", "Лебедевич", "Левкович", "Лисовская", "Лукашевич", "Лысенко", "Макаревич", "Малиновская", "Мартинович", "Матвеевич", "Матусевич", "Мелешко", "Миклашевич", "Миронович", "Михневич", "Можейко", "Морозевич", "Наумович", "Новицкая", "Орлович", "Павлович", "Петкевич", "Петрович", "Пименович", "Половинко", "Прокопович", "Рагунович", "Романович", "Рудкевич", "Савицкая", "Санько", "Сапего", "Семашко", "Сергеевич", "Сильванович", "Скакун", "Смолич", "Соколовская", "Стасевич", "Степанович", "Тарасевич", "Тимофеевич", "Титович", "Ткачевич", "Толкач", "Тумилович", "Урбанович", "Федорович", "Филиппович", "Харитонович", "Ходасевич", "Царевич", "Черепович", "Шавель", "Шидловская", "Шимко", "Шилович", "Ширко", "Шишко", "Якимович", "Янушкевич", "Ярмолович", "Яскевич"
    );

    public BelorussianFemaleFIO() {
        super.names = NATIONAL_NAMES;
        super.surnames = NATIONAL_SURNAMES;
    }
}

