package org.example.staticdata.belorussian;

import org.example.staticdata.AbstractFIO;

import java.util.List;

public class BelorussianMaleFIO extends AbstractFIO {
    private static final List<String> NATIONAL_NAMES = List.of(
            "Адам", "Александр", "Алексей", "Анатолий", "Андрей", "Антон", "Аркадий", "Артем", "Богдан", "Борис", "Бронислав", "Вадим", "Валентин", "Валерий", "Василий", "Виктор", "Виталий", "Владимир", "Владислав", "Всеволод", "Вячеслав", "Геннадий", "Георгий", "Глеб", "Григорий", "Даниил", "Денис", "Дмитрий", "Евгений", "Егор", "Захар", "Иван", "Игнат", "Игорь", "Илья", "Иосиф", "Казимир", "Кирилл", "Константин", "Лев", "Леонид", "Максим", "Марк", "Михаил", "Назар", "Никита", "Николай", "Олег", "Павел", "Петр", "Ростислав", "Руслан", "Святослав", "Семен", "Сергей", "Станислав", "Степан", "Тарас", "Тимофей", "Федор", "Феликс", "Филипп", "Франциск", "Эдуард", "Юрий", "Ян", "Ярослав"
    );

    private static final List<String> NATIONAL_SURNAMES = List.of(
            "Ковалёв", "Новиков", "Морозов", "Павлов", "Сидоров", "Борисов", "Захаров", "Иванов", "Петров", "Смирнов", "Фёдоров", "Григорьев", "Семёнов", "Лебедев", "Егоров", "Козлов", "Николаев", "Макаров", "Андреев", "Дмитриев", "Кузнецов", "Соколов", "Михайлов", "Волков", "Романов", "Орлов", "Киселёв", "Белов", "Титов", "Марков", "Соловьёв", "Алексеев", "Яковлев", "Фомин", "Давыдов", "Гусев", "Вишняков", "Богданов", "Коновалов", "Савельев", "Жуков", "Тарасов", "Мельников", "Щербаков", "Баранов", "Поляков", "Карпов", "Шестаков", "Горбачёв", "Кудрявцев", "Лазарев", "Медведев", "Ермаков", "Тихонов", "Савин", "Чернов", "Зайцев", "Прохоров", "Ильин", "Филиппов", "Комаров", "Денисов", "Голубев", "Антипов", "Артемьев", "Логинов", "Казаков", "Афанасьев", "Терентьев", "Власов", "Мухин", "Жданов", "Кононов", "Лыткин", "Субботин", "Щукин", "Лапин", "Панфилов", "Костин", "Широков", "Хомяков", "Фирсов", "Дорофеев", "Еремеев", "Горшков", "Сафонов", "Прокофьев", "Старостин", "Калашников", "Дементьев", "Клюев", "Носков", "Одинцов", "Крутов", "Зимин", "Филатов", "Маслов", "Рогов", "Абрамов", "Воронов", "Герасимов", "Ефимов", "Зуев", "Игнатьев", "Королёв", "Логинов", "Майоров", "Наумов", "Осипов", "Пономарёв", "Решетников", "Сорокин", "Трофимов", "Ушаков", "Харитонов", "Цветков", "Шубин", "Щеглов", "Юдин", "Якушев"

    );

    public BelorussianMaleFIO() {
        super.names = NATIONAL_NAMES;
        super.surnames = NATIONAL_SURNAMES;
    }
}

