package org.example.staticdata.georgian;

import org.example.staticdata.AbstractFIO;

import java.util.List;

public class GeorgianFemaleFIO extends AbstractFIO {
    private static final List<String> NATIONAL_NAMES = List.of(
            "Тамара", "Наталья", "Нино", "Манана", "Мариам", "Кетеван", "Лика", "Софико", "Эка", "Нани", "Дареджан", "Мзевинар", "Натия", "Татия", "Мака", "Лали", "Иринэ", "Циала", "Саломэ", "Теона", "Марьям", "Русудан", "Софо", "Мари", "Нана", "Анна", "Этери", "Натела", "Отариа", "Тинатин", "Катиа", "Медея", "Гуранда", "Ламара", "Цицино", "Зейнаб", "Давидэ", "Тамта", "Мзия", "Эленэ"
    );

    private static final List<String> NATIONAL_SURNAMES = List.of(
            "Абашидзе", "Авалианидзе", "Ахметелидзе", "Бердзенидзе", "Гамкрелидзе", "Гонгадзе", "Джапаридзе", "Кикнадзе", "Кипшидзе", "Мгалоблидзе", "Мчедлидзе", "Силагадзе", "Церетелидзе", "Чикованидзе", "Чихладзе", "Шаликашвилидзе", "Шарашидзе", "Шеварднадзе", "Абрамишвили", "Адамишвили", "Багратионишвили", "Гамсахурдиашвили", "Гогиашвили", "Гургенишвили", "Долидзешвили", "Каландаришвили", "Квирикашвили", "Меликишвили", "Нателашвили", "Палиашвили", "Саакашвили", "Тодуашвили", "Хабелашвили", "Цицишвили", "Чавчавадзешвили", "Чичинадзешвили", "Шатиришвили", "Агладзеури", "Гвасалияули", "Долидзеури", "Квирквелияули", "Лашкарули", "Топуриаули", "Хораваури", "Чантуриаули", "Берулая", "Гурулия", "Кобахия", "Кокочая", "Ломия", "Таргамая", "Хабулия", "Амилахвариани", "Дадиани", "Марганияни", "Орбелиани", "Церетелиани", "Челокаевани", "Эриставиани", "Абуладзе", "Апхазидзе", "Бараташвили", "Вирсаладзе", "Зедгинидзе", "Коринтели", "Мхеидзе", "Павленишвили", "Разикадзе", "Стуруа", "Тиканадзе", "Хундадзе", "Чарквиани", "Чолокашвили"
    );

    public GeorgianFemaleFIO() {
        super.names = NATIONAL_NAMES;
        super.surnames = NATIONAL_SURNAMES;
    }
}

