package org.example.staticdata.georgian;

import org.example.staticdata.AbstractFIO;

import java.util.List;

public class GeorgianMaleFIO extends AbstractFIO {
    private static final List<String> NATIONAL_NAMES = List.of(
            "Гиорги", "Давид", "Николоз", "Иракли", "Леван", "Александре", "Вано", "Зураб", "Торнике", "Мераб", "Михаил", "Шота", "Отар", "Гига", "Гоча", "Теймураз", "Вахтанг", "Бадри", "Бесо", "Григол", "Дато", "Джумбер", "Константине", "Лаша", "Малхаз", "Реваз", "Серго", "Тенгиз", "Элгуджа", "Яго"
    );

    private static final List<String> NATIONAL_SURNAMES = List.of(
            "Абашидзе", "Авалианидзе", "Абхазава", "Адамиа", "Аладашвили", "Амилахвари", "Анчабадзе", "Апхаидзе", "Асатиани", "Арвеладзе", "Бабуридзе", "Багратиони", "Барамидзе", "Бараташвили", "Беридзе", "Битадзе", "Бокерия", "Бондошвили", "Вашадзе", "Векуа", "Габуния", "Гамкрелидзе", "Гамсахурдия", "Гелашвили", "Гогоберидзе", "Гогиашвили", "Гоциридзе", "Гурамишвили", "Гургенидзе", "Дадиани", "Двалишвили", "Джавахишвили", "Джапаридзе", "Джикия", "Дзнеладзе", "Диасамидзе", "Долидзе", "Думбадзе", "Жвания", "Жоржолиани", "Зурабишвили", "Иоселиани", "Какабадзе", "Каладзе", "Капанадзе", "Квирквелия", "Кереселидзе", "Кецбая", "Кикалейшвили", "Кикнадзе", "Кипиани", "Кобахидзе", "Коридзе", "Курдиани", "Курцхилава", "Кухианидзе", "Лагидзе", "Ломидзе", "Лорткипанидзе", "Магалашвили", "Майсурадзе", "Макашвили", "Мамиашвили", "Маргания", "Мгеладзе", "Мдивани", "Меликишвили", "Месхи", "Микадзе", "Мирцхулава", "Мхеидзе", "Надирадзе", "Накашидзе", "Нинуа", "Одишария", "Окруашвили", "Патарая", "Пипия", "Поладян", "Пулладзе", "Разикадзе", "Робакидзе", "Саакадзе", "Сагарадзе", "Санакоев", "Сардалишвили", "Силагадзе", "Схиртладзе", "Тавадзе", "Таргамадзе", "Тибадзе", "Тодуа", "Топурия", "Турманидзе", "Убилава", "Учанейшвили", "Хабелов", "Хаиндрава", "Хачапуридзе", "Хорава", "Хубутия", "Цакадзе", "Церетели", "Циклаури", "Цинамдзгвришвили", "Цискаридзе", "Цихисшвили", "Цулукидзе", "Чантурия", "Чарквиани", "Чеишвили", "Чиковани", "Чичинадзе", "Чкония", "Чохонелидзе", "Чхеидзе", "Шаликашвили", "Шарашидзе", "Шарикадзе", "Шаршиашвили", "Шашиашвили", "Шелия", "Шенгелия", "Шервашидзе", "Шония", "Эбралидзе", "Элиава", "Эристави"
    );

    public GeorgianMaleFIO() {
        super.names = NATIONAL_NAMES;
        super.surnames = NATIONAL_SURNAMES;
    }
}

