package org.example.staticdata.russian;

import org.example.staticdata.AbstractFIO;

import java.util.List;

public class RussianMaleFIO extends AbstractFIO {
    private static final List<String> NATIONAL_NAMES = List.of(
            "Александр", "Алексей", "Анатолий", "Андрей", "Антон", "Аркадий", "Арсений", "Артём", "Богдан", "Борис", "Вадим", "Валентин", "Валерий", "Василий", "Виктор", "Виталий", "Владимир", "Владислав", "Вячеслав", "Геннадий", "Георгий", "Глеб", "Григорий", "Даниил", "Денис", "Дмитрий", "Евгений", "Егор", "Захар", "Иван", "Игорь", "Илья", "Кирилл", "Константин", "Лев", "Леонид", "Максим", "Марат", "Марк", "Матвей", "Михаил", "Никита", "Николай", "Олег", "Павел", "Пётр", "Роман", "Руслан", "Семён", "Сергей", "Станислав", "Степан", "Тимофей", "Фёдор", "Эдуард", "Юрий", "Яков", "Ярослав"
    );

    private static final List<String> NATIONAL_SURNAMES = List.of(
            "Иванов", "Петров", "Сидоров", "Смирнов", "Кузнецов", "Попов", "Васильев", "Фёдоров", "Михайлов", "Новиков", "Морозов", "Волков", "Алексеев", "Лебедев", "Семёнов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьёв", "Борисов", "Яковлев", "Григорьев", "Романов", "Воробьёв", "Сергеев", "Гусев", "Титов", "Филиппов", "Марков", "Белов", "Комаров", "Карпов", "Дмитриев", "Киселёв", "Савельев", "Шестаков", "Герасимов", "Поляков", "Данилов", "Жуков", "Фролов", "Жданов", "Назаров", "Крылов", "Власов", "Маслов", "Исаев", "Тихонов", "Аксёнов", "Гаврилов", "Родионов", "Котов", "Горбунов", "Кудрявцев", "Быков", "Зуев", "Третьяков", "Савин", "Лазарев", "Рябов", "Суханов", "Бирюков", "Копылов", "Гордеев", "Самойлов", "Князев", "Потапов", "Королёв", "Денисов", "Мельников", "Щербаков", "Блинов", "Колесников", "Чернов", "Овчинников", "Селиверстов", "Панфилов", "Кочетков", "Суворов", "Черкасов", "Рыбаков", "Стрельцов", "Кондратьев", "Силин", "Меркушев", "Лыткин", "Туров", "Капустин", "Антипов", "Лаптев", "Рогов", "Одинцов", "Нестеров", "Куликов", "Ефимов", "Тарасов", "Соболев", "Якушев", "Горшков", "Ермаков", "Дементьев", "Русаков", "Кабанов", "Носков", "Юдин", "Кулагин", "Лопатин", "Прохоров", "Наумов", "Похлёбкин", "Шубин", "Голубев", "Воронцов", "Ершов", "Архипов", "Дорофеев", "Лаврентьев", "Зимин", "Красильников", "Сафонов", "Трофимов", "Белоусов", "Старостин", "Субботин", "Дроздов", "Ларионов", "Прокофьев", "Коновалов", "Сысоев", "Калашников", "Корнеев", "Евсеев", "Баранов", "Ширяев", "Большаков", "Устинов", "Веселов", "Филатов", "Фомин", "Дружинин", "Шилов", "Агафонов", "Муравьёв", "Логинов", "Ерёмин", "Кошелев", "Костин", "Лавров", "Елисеев", "Золотов", "Кожевников", "Майоров", "Демин", "Лужков", "Туманов", "Беляков", "Кузьмин", "Дьяконов", "Софронов", "Громов", "Фокин", "Демьянов", "Кононов", "Щукин", "Лапшин", "Мясников", "Анисимов", "Варламов", "Уваров", "Лихачёв", "Телегин", "Фадеев", "Давыдов", "Бобылёв", "Доронин", "Белозёров", "Рожков", "Самсонов", "Мясников", "Булатов", "Шаров", "Бессонов", "Гришин", "Корчагин", "Емельянов", "Рубцов", "Орехов", "Цветков", "Мухин", "Лавров", "Казаков", "Щеглов", "Игнатов", "Куприянов", "Кулешов", "Чистяков", "Панков", "Дегтярёв", "Жилин", "Савицкий", "Горбачёв", "Симонов", "Терентьев", "Молчанов", "Владимиров", "Артемьев", "Гурьев", "Зиновьев", "Греков", "Казанцев", "Швецов", "Ермилов", "Парамонов", "Агеев", "Головин", "Лотоцкий", "Токарев", "Сапунов", "Ростов", "Селезнёв", "Черепанов", "Галкин", "Назаров", "Лобов", "Буров", "Сизов", "Воронов", "Воронков", "Голованов", "Корнилов", "Литвинов", "Евдокимов", "Осокин", "Шевцов", "Долгов", "Суслов", "Шевченко", "Котовский", "Лукин", "Тихомиров", "Власов", "Королёв", "Бондарев", "Гладков", "Беляев", "Горбатов", "Сухарев", "Курочкин", "Крюков", "Булгаков", "Ладыгин", "Левин", "Бирюков", "Коробов", "Нефёдов", "Сорокин", "Терентьев", "Тимофеев", "Филимонов", "Харитонов", "Чернышёв", "Шарапов", "Щепин", "Юрьев", "Яшин"
    );

    public RussianMaleFIO() {
        super.names = NATIONAL_NAMES;
        super.surnames = NATIONAL_SURNAMES;
    }
}

