package org.example.staticdata.russian;

import org.example.staticdata.AbstractFIO;

import java.util.List;

public class RussianFemaleFIO extends AbstractFIO {
    private static final List<String> NATIONAL_NAMES = List.of(
            "Александра", "Алина", "Алиса", "Алла", "Анастасия", "Ангелина", "Анна", "Антонина", "Арина", "Валентина", "Валерия", "Варвара", "Василиса", "Вера", "Вероника", "Виктория", "Галина", "Дарья", "Евгения", "Екатерина", "Елена", "Лена", "Елизавета", "Жанна", "Зинаида", "Зоя", "Инна", "Ирина", "Карина", "Кира", "Клавдия", "Кристина", "Ксения", "Лариса", "Лидия", "Лилия", "Любовь", "Людмила", "Маргарита", "Марина", "Мария", "Милана", "Надежда", "Наталья", "Нина", "Оксана", "Олеся", "Ольга", "Полина", "Раиса", "Светлана", "София", "Таисия", "Тамара", "Татьяна", "Ульяна", "Юлия", "Яна", "Ярослава"
    );

    private static final List<String> NATIONAL_SURNAMES = List.of(
            "Абрамова", "Авдеева", "Агапова", "Аксёнова", "Александрова", "Алексеева", "Андреева", "Анисимова", "Антонова", "Артемьева", "Архипова", "Афанасьева", "Баранова", "Белова", "Белоусова", "Беляева", "Белякова", "Березина", "Бессонова", "Бирюкова", "Блинова", "Богданова", "Борисова", "Бородина", "Бурова", "Быкова", "Васильева", "Виноградова", "Власова", "Волкова", "Воробьёва", "Гаврилова", "Герасимова", "Головач", "Голубева", "Гончарова", "Горбунова", "Гордеева", "Горшкова", "Григорьева", "Громова", "Гусева", "Давыдова", "Данилова", "Демидова", "Денисова", "Дмитриева", "Доронина", "Дроздова", "Евдокимова", "Егорова", "Елисеева", "Емельянова", "Ермакова", "Ершова", "Ефимова", "Жданова", "Жукова", "Зайцева", "Зимина", "Зорина", "Зуева", "Иванова", "Игнатова", "Ильина", "Исаева", "Казакова", "Калинина", "Карпова", "Киселёва", "Климова", "Ковалёва", "Козлова", "Комарова", "Коновалова", "Копылова", "Королёва", "Костина", "Котова", "Кравцова", "Краснова", "Крылова", "Кудрявцева", "Кузнецова", "Кузьмина", "Куликова", "Лаврентьева", "Лазарева", "Лебедева", "Литвинова", "Лобова", "Логинова", "Лопатина", "Лукьянова", "Макарова", "Максимова", "Мамонтова", "Маркова", "Мартынова", "Маслова", "Матвеева", "Медведева", "Мельникова", "Миронова", "Михайлова", "Моисеева", "Морозова", "Назарова", "Наумова", "Некрасова", "Никитина", "Никифорова", "Николаева", "Новикова", "Овчинникова", "Одинцова", "Орлова", "Осипова", "Павлова", "Панова", "Петрова", "Полякова", "Пономарёва", "Попова", "Потапова", "Прохорова", "Романова", "Рубцова", "Русакова", "Рыбакова", "Савельева", "Сазонова", "Самойлова", "Семёнова", "Сергеева", "Сидорова", "Симонова", "Смирнова", "Соболева", "Соколова", "Соловьёва", "Сорокина", "Степанова", "Суханова", "Тарасова", "Терентьева", "Тимофеева", "Титова", "Тихонова", "Ткачёва", "Третьякова", "Трофимова", "Уварова", "Устинова", "Фёдорова", "Филиппова", "Фокина", "Фомина", "Хохлова", "Цветкова", "Чернова", "Чернышёва", "Шарапова", "Шестакова", "Шилова", "Шубина", "Щербакова", "Яковлева", "Якушева", "Яшина"
    );

    public RussianFemaleFIO() {
        super.names = NATIONAL_NAMES;
        super.surnames = NATIONAL_SURNAMES;
    }
}

