package org.example.staticdata.ukranian;

import org.example.staticdata.AbstractFIO;

import java.util.List;

public class UkranianMaleFIO extends AbstractFIO {
    private static final List<String> NATIONAL_NAMES = List.of(
            "Александр", "Алексей", "Анатолий", "Андрей", "Антон", "Аркадий", "Арсений", "Артём", "Богдан", "Борис", "Вадим", "Валентин", "Валерий", "Василий", "Виктор", "Виталий", "Владимир", "Владислав", "Вячеслав", "Геннадий", "Георгий", "Глеб", "Григорий", "Даниил", "Денис", "Дмитрий", "Евгений", "Егор", "Захар", "Иван", "Игорь", "Илья", "Кирилл", "Константин", "Лев", "Леонид", "Максим", "Марат", "Марк", "Матвей", "Михаил", "Никита", "Николай", "Олег", "Павел", "Пётр", "Роман", "Руслан", "Семён", "Сергей", "Станислав", "Степан", "Тимофей", "Фёдор", "Эдуард", "Юрий", "Яков", "Ярослав"
    );

    private static final List<String> NATIONAL_SURNAMES = List.of(
            "Авраменко", "Андрієнко", "Бабенко", "Балабан", "Бандура", "Баран", "Белей", "Білий", "Білик", "Білодід", "Боднар", "Бойко", "Бондар", "Бондаренко", "Борисенко", "Броварчук", "Бурмака", "Василенко", "Васильчук", "Винник", "Вовк", "Волощук", "Гавриленко", "Гаврилюк", "Гайдай", "Галайчук", "Герасименко", "Гладкий", "Гнатюк", "Головач", "Головко", "Гончар", "Гончаренко", "Горбач", "Гордієнко", "Григоренко", "Гриценко", "Гуменюк", "Даниленко", "Данилюк", "Данько", "Демиденко", "Демчук", "Дзюба", "Дмитренко", "Довгалюк", "Дяченко", "Жадан", "Журавель", "Журба", "Забіла", "Заєць", "Захаренко", "Зінченко", "Зінчук", "Іваненко", "Іваничук", "Іванченко", "Калиненко", "Кириленко", "Коваленко", "Коваль", "Ковальчук", "Козак", "Козаченко", "Колесник", "Коломієць", "Кондратюк", "Корж", "Корнієнко", "Король", "Корольчук", "Костенко", "Кравченко", "Кравчук", "Кузьменко", "Кучер", "Кушнір", "Левченко", "Лисенко", "Литвин", "Литвиненко", "Лубенець", "Лукаш", "Ляшко", "Мазур", "Максимчук", "Малишко", "Марченко", "Матвієнко", "Мельник", "Мельниченко", "Микитенко", "Мироненко", "Михайленко", "Міщенко", "Москаленко", "Назаренко", "Нестеренко", "Овсієнко", "Овчаренко", "Олійник", "Онищенко", "Опанасенко", "Орлик", "Остапчук", "Панченко", "Петренко", "Пилипенко", "Піддубний", "Поліщук", "Приймак", "Приходько", "Прокопенко", "Проценко", "Рибак", "Рибалка", "Романенко", "Романчук", "Руденко", "Савченко", "Савчук", "Самойленко", "Самсоненко", "Свириденко", "Семенчук", "Сердюк", "Середа", "Сич", "Скрипка", "Слободян", "Соловей", "Сорока", "Стасюк", "Степаненко", "Стеценко", "Тарасенко", "Тарасюк", "Терещенко", "Тимченко", "Тищенко", "Ткач", "Ткаченко", "Толочко", "Томенко", "Турчин", "Усик", "Федоренко", "Фоменко", "Харченко", "Хоменко", "Царенко", "Черненко", "Чорновіл", "Шевченко", "Шинкаренко", "Шиян", "Шовкопляс", "Шульга", "Юрченко", "Якименко", "Яковенко", "Яременко", "Яремчук", "Ярошенко", "Яценко", "Береза", "Бондарчук", "Борисюк", "Василечко", "Верес", "Витвицький", "Галага", "Герега", "Голуб", "Горобець", "Гошовський", "Дерев'янко", "Дмитрук", "Жайворонок", "Затула", "Калита", "Кмита", "Ковальський", "Колодій", "Комар", "Корпан", "Косенко", "Костюк", "Котенко", "Кочерга", "Кравців", "Кривенко", "Кулик", "Лаба", "Линник", "Лозовий", "Майстренко", "Макогон", "Мельничук", "Мірошниченко", "Моторний", "Наливайко", "Огірко", "Олефір", "Онипко", "Опанасенко", "Пальчевський", "Панчук", "Пархоменко", "Петлюра", "Пилипчук", "Погрібний", "Притула", "Романів", "Сахно", "Свистун", "Семотюк", "Сергієнко", "Сірко", "Скиба", "Скорик", "Слюсар", "Сопілка", "Сторожук", "Тарарака", "Терещук", "Тимчук", "Ткачук", "Третяк", "Федорчук", "Хмара", "Цибульський", "Чайка", "Чередниченко", "Шамрай", "Шевчук", "Шеремета", "Шило", "Шматко", "Яворський", "Якубовський", "Ярмола", "Ярош"
    );

    public UkranianMaleFIO() {
        super.names = NATIONAL_NAMES;
        super.surnames = NATIONAL_SURNAMES;
    }
}

