package org.example.staticdata.ukranian;

import org.example.staticdata.AbstractFIO;

import java.util.List;

public class UkranianFemaleFIO extends AbstractFIO {
    private static final List<String> NATIONAL_NAMES = List.of(
            "Алина", "Алиса", "Алла", "Анастасия", "Ангелина", "Анжела", "Анна", "Антонина", "Арина", "Богдана", "Богуслава", "Валентина", "Валерия", "Варвара", "Василина", "Вероника", "Виктория", "Виолетта", "Вера", "Виталина", "Галина", "Дарина", "Дарья", "Диана", "Эвелина", "Ева", "Елизавета", "Жанна", "Злата", "Зоряна", "Иванна", "Инна", "Ирина", "Екатерина", "Квитка", "Кира", "Клавдия", "Корнелия", "Ксения", "Лада", "Лариса", "Лиана", "Лиза", "Лилия", "Любава", "Любовь", "Людмила", "Майя", "Маргарита", "Марина", "Мария", "Маруся", "Марьяна", "Мелания", "Милана", "Мирослава", "Надежда", "Наталья", "Ника", "Оксана", "Елена", "Олеся", "Ольга", "Орися", "Полина", "Рада", "Раиса", "Роксолана", "Руслана", "Светлана", "Слава", "Снежана", "Соломия", "София", "Таисия", "Тамара", "Татьяна", "Ульяна", "Кристина", "Юлия", "Яна", "Ярина", "Ярослава"

    );

    private static final List<String> NATIONAL_SURNAMES = List.of(
            "Авраменко", "Андрієнко", "Бабенко", "Балабан", "Бандура", "Баран", "Белей", "Біленька", "Білик", "Білодід", "Боднар", "Бойко", "Бондар", "Бондаренко", "Борисенко", "Броварчук", "Бурмака", "Василенко", "Васильчук", "Винник", "Вовк", "Волощук", "Гавриленко", "Гаврилюк", "Гайдай", "Галайчук", "Герасименко", "Гладка", "Гнатюк", "Головач", "Головко", "Гончар", "Гончаренко", "Горбач", "Гордієнко", "Григоренко", "Гриценко", "Гуменюк", "Даниленко", "Данько", "Демиденко", "Демчук", "Дзюба", "Дмитренко", "Довгалюк", "Дяченко", "Жадан", "Журавель", "Журба", "Забіла", "Заєць", "Захаренко", "Зінченко", "Зінчук", "Іваненко", "Іваничук", "Іванченко", "Калиненко", "Кириленко", "Коваленко", "Коваль", "Ковальчук", "Козак", "Козаченко", "Колесник", "Коломієць", "Кондратюк", "Корж", "Корнієнко", "Король", "Корольчук", "Костенко", "Кравченко", "Кравчук", "Кузьменко", "Кучер", "Кушнір", "Левченко", "Лисенко", "Литвин", "Литвиненко", "Лубенець", "Лукаш", "Ляшко", "Мазур", "Максимчук", "Малишко", "Марченко", "Матвієнко", "Мельник", "Мельниченко", "Микитенко", "Мироненко", "Михайленко", "Міщенко", "Москаленко", "Назаренко", "Нестеренко", "Овсієнко", "Овчаренко", "Олійник", "Онищенко", "Опанасенко", "Орлик", "Остапчук", "Панченко", "Петренко", "Пилипенко", "Піддубна", "Поліщук", "Приймак", "Приходько", "Прокопенко", "Проценко", "Рибак", "Рибалка", "Романенко", "Романчук", "Руденко", "Савченко", "Савчук", "Самойленко", "Самсоненко", "Свириденко", "Семенчук", "Сердюк", "Середа", "Сич", "Скрипка", "Слободян", "Соловей", "Сорока", "Стасюк", "Степаненко", "Стеценко", "Тарасенко", "Тарасюк", "Терещенко", "Тимченко", "Тищенко", "Ткач", "Ткаченко", "Толочко", "Томенко", "Турчин", "Усик", "Федоренко", "Фоменко", "Харченко", "Хоменко", "Царенко", "Черненко", "Чорновол", "Шевченко", "Шинкаренко", "Шиян", "Шовкопляс", "Шульга", "Юрченко", "Якименко", "Яковенко", "Яременко", "Яремчук", "Ярошенко", "Яценко"
    );

    public UkranianFemaleFIO() {
        super.names = NATIONAL_NAMES;
        super.surnames = NATIONAL_SURNAMES;
    }
}

